@ inline function diffusivityTensor(conservation_law::NavierStokesEquations{d},
    u::AbstractVector{Float64},
    ∇u::AbstractMatrix{Float64}) where {d}

(; γ_minus_1, cv, cp, Tref, μref, Sμref) = conservation_law

# precompute quantites 
μ = μref * (T/Tref)^(3/2) * (Tref + Sμref) / (T + Sμref)
κ = μ * cp / 0.71 # maybe do it using sutherlands law...
R = cp - cv
gkr=γ_minus_1*κ/R
u1 = u[1]
u2 = u[2]
u3 = u[3]
u4 = u[4]
u5 = u[5]
v2 = u2^2+u3^2+u4^2
p = (γ_minus_1) * (u5 - 0.5 * (u2^2 + u3^2 + u4^2) / u1)

K11 = [0,  0,  0,  0,  0;
    -4/3*μ*u2/u1^2, 4/3*μ/u1, 0, 0, 0; 
    -μ*u3/u1^2, 0, 4/3*μ/u1, 0, 0;
    -u4/u1^2*μ, 0, 0, μ/u1, 0;
    gkr*(v2/(2*u1^3)-p/(γ-1)*u1^2) - μ/u1^3*(u2^2*4/3+u3^2+u4^2), -gkr*u2/u1^2+4/3*μ*u2/u1^2, -gkr*u3/u1^2+μ*u3/u1^2, -gkr*u4/u1^2+u4/u1^2*μ, gkr/u1;]

K12 = [0,  0,  0,  0,  0;
    2/3*μ*u3/u1^2, 0, -2/3*μ/u1, 0, 0;
    -μ*u2/u1^2, μ/u1, 0, 0, 0;
    0, 0, 0, 0, 0;
    -μ/u1^3*(1/3*u2*u3), μ*u3/u1^2, -2/3*μ*u2/u1^2, 0, 0;]

K13 = [0,  0,  0,  0,  0;
    2/3*μ*u4/u1^2, 0, 0, -2/3*μ/u1, 0;
    0, 0, 0, 0, 0;
    -μ*u2/u1^2, μ/u1, 0, 0, 0;
    -μ/u1^3*(1/3*u2*u4), μ*u4/u1^2, 0, -2/3*μ*u2/u1^2, 0;]

K21 = [0,  0,  0,  0,  0;
    -μ*u3/u1^2, 0, μ/u1, 0, 0;
    2/3*μ*u2/u1, -2/3*μ/u1, 0, 0, 0;
    0, 0, 0, 0, 0;
    -μ/u1^3*(1/3*u2*u3), -2/3*μ*u3/u1^2, μ*u2/u1^2, 0, 0;]

K22 = [0,  0,  0,  0,  0;
    -u2/u1^2*μ, μ/u1, 0, 0, 0;
    -4/3*μ*u3/u1^2, 0, 4/3*μ/u1, 0, 0;
    -u4/u1^2*μ, 0, 0, μ/u1, 0;
    gkr*(v2/(2*u1^3)-p/(γ-1)*u1^2) - μ/u1^3*(u2^2+u3^2*4/3+u4^2), -gkr*u2/u1^2+μ*u2/u1^2, -gkr*u3/u1^2+4/3*μ*u3/u1^2, -gkr*u4/u1^2+u4/u1^2*μ, gkr/u1;]

K23 = [0,  0,  0,  0,  0;
    0, 0, 0, 0, 0;
    2/3*μ*u4/u1^2, 0, 0, -2/3*μ/u1, 0;
    -μ*u3/u1^2, 0, μ/u1, 0, 0;
    -μ/u1^3*(1/3*u3*u4), 0, μ*u4/u1^2, -2/3*μ*u3/u1^2, 0;]

K31 = [0,  0,  0,  0,  0;
    -μ*u4/u1^2, 0, 0, μ/u1, 0;
    0, 0, 0, 0, 0;
    2/3*μ*u2/u1^2, -2/3*μ/u1, 0, 0, 0;
    -μ/u1^3*(1/3*u2*u4), -2/3*μ*u4/u1^2, 0, μ*u2/u1^2, 0;]

K32 = [0,  0,  0,  0,  0;
    0, 0, 0, 0, 0;
    -μ*u4/u1^2, 0, 0, μ/u1, 0;
    2/3*μ*u3/u1^2, 0, -2/3*μ/u1, 0, 0;
    -μ/u1^3*(1/3*u3*u4), 0, -2/3*μ*u4/u1^2, μ*u3/u1^2, 0;]

K33 = [0,  0,  0,  0,  0;
    -u2/u1^2*μ, μ/u1, 0, 0, 0;
    -u3/u1^2*μ, 0, μ/u1, 0, 0;
    -4/3*μ*u4/u1^2, 0, 0, 4/3*μ/u1, 0;
    gkr*(v2/(2*u1^3)-p/(γ-1)*u1^2) - μ/u1^3*(u2^2+u3^2+u4^2*4/3), -gkr*u2/u1^2+μ*u2/u1^2, -gkr*u3/u1^2+μ*u3/u1^2, -gkr*u4/u1^2+4/3*μ*u4/u1^2, gkr/u1;]

return ((K11, K12, K13),(K21, K22, K23),(K31, K32, K33))
end